{"language": "en", "language_probability": 1, "segments": [{"start": 0.0, "end": 5.5200000000000005, "text": " What's going on guys this is Rob and we are here with the venom civil war and the ending of this"}, {"start": 5.92, "end": 10.96, "text": " Is either going to blow your mind or you're going to hate it. We'll find out so what this does is this opens up"}, {"start": 11.36, "end": 13.52, "text": " with eddie brock as bedlam"}, {"start": 14.16, "end": 16.0, "text": " fighting bedlam"}, {"start": 16.0, "end": 19.44, "text": " So for all the new people here what in the world is going on?"}, {"start": 19.44, "end": 22.72, "text": " Well number one you will find a link to the venom playlist at the end of this video"}, {"start": 23.28, "end": 27.12, "text": " And two the best way to describe what's happening is to really just explain, right?"}, {"start": 27.2, "end": 32.480000000000004, "text": " So when eddie brock as the king in black meaning he has control over all the symbiotes in his universe"}, {"start": 32.88, "end": 40.72, "text": " When he died, he went to what appeared to be an afterlife literally a place that was composed entirely of symbiote matter"}, {"start": 41.04, "end": 47.68, "text": " And that within this place there were these other symbiotes that you had bedlam and wild and tyro and so on and so forth"}, {"start": 48.08, "end": 50.08, "text": " Each one of these different symbiotes"}, {"start": 50.540000000000006, "end": 56.72, "text": " Represented basically eddie brock as he was transitioning through what we would call the five stages of grief"}, {"start": 56.96, "end": 60.1, "text": " And then eventually going on to join what was called the eventuality"}, {"start": 60.48, "end": 66.8, "text": " Which is essentially this kind of multiversal being that is the result of every king in black across the multiverse"}, {"start": 67.36, "end": 74.4, "text": " Merging into one entity now along this path eddie brock will become a guy named meridius"}, {"start": 74.48, "end": 81.28, "text": " Which is by our standards of measurement the sum total of everything a king in black could possibly be"}, {"start": 81.68, "end": 86.72, "text": " Full control over their powers full control over all symbiote matter in existence"}, {"start": 87.04, "end": 94.0, "text": " It's as powerful as he's ever going to be the kicker here is that meridius did not want to join the eventuality"}, {"start": 94.0, "end": 96.0, "text": " He wanted to conquer all of creation"}, {"start": 96.16, "end": 102.16, "text": " And so eddie brock had basically been working before he became meridius literally racing against the clock"}, {"start": 103.12, "end": 106.98, "text": " In order to find a way to one stop himself from becoming meridius"}, {"start": 107.3, "end": 112.18, "text": " And two find a way to defeat meridius before he could essentially conquer all of creation"}, {"start": 112.58, "end": 118.66, "text": " now because this always happens with every king in black what eddie brock did is he found that he could actually"}, {"start": 119.36, "end": 124.58000000000001, "text": " Untether himself to this fate quite literally walk away and that in doing so"}, {"start": 124.82000000000001, "end": 127.86, "text": " He would not have to become meridius, which is exactly what he did"}, {"start": 128.18, "end": 132.9, "text": " But he also did it with the bedlam symbiont and that's the reason why the two of them here"}, {"start": 133.3, "end": 138.1, "text": " Are fighting against all the other symbiotes because what this fight does as he's like"}, {"start": 138.5, "end": 140.26000000000002, "text": " Tearing these guys apart, right?"}, {"start": 140.26000000000002, "end": 146.5, "text": " Like literally it's a cool explanation that you get here that one of them says i'm eddie brock and the main eddie himself"}, {"start": 146.5, "end": 152.76, "text": " We'll call him eddie prime that he says we all are dummy just different versions from different timelines"}, {"start": 153.14000000000001, "end": 156.26, "text": " Branching off from the original which is essentially him"}, {"start": 156.5, "end": 160.82, "text": " He says for instance i'm the eddie brock who just tore your full head off"}, {"start": 161.06, "end": 163.7, "text": " Of course is him just kind of you know musing with this guy"}, {"start": 163.94, "end": 170.98, "text": " But again as these dudes are watching literally tyro as tyro and wild are watching this fight unfold"}, {"start": 171.38, "end": 173.14, "text": " They come to the realization"}, {"start": 173.14, "end": 179.14, "text": " They're not destined to become meridius that it was a great lie that meridius came up"}, {"start": 179.29999999999998, "end": 185.94, "text": " In order to essentially keep them from challenging him for power because the reality here is that they are all seemingly"}, {"start": 186.18, "end": 188.57999999999998, "text": " Equal in their abilities in what they can do"}, {"start": 188.9, "end": 190.34, "text": " Yes, they're all kings in black"}, {"start": 190.34, "end": 198.18, "text": " But the only thing that differentiates eddie brock from tyro and wild and bedlam is either some measure of heightened aggression"}, {"start": 198.5, "end": 206.02, "text": " Or how they perceive themselves and that's basically it but by them appearing here in this realm that was created by meridius"}, {"start": 206.02, "end": 210.68, "text": " Right their final form essentially that meridius put forward this ideology"}, {"start": 210.98000000000002, "end": 212.82000000000002, "text": " You are lesser than I am, right?"}, {"start": 212.9, "end": 214.57999999999998, "text": " I am not really your god"}, {"start": 214.57999999999998, "end": 220.5, "text": " But I am what you will eventually become and that in that form I am more powerful than all of you"}, {"start": 220.66, "end": 226.42, "text": " But that's not the case the ability to manipulate symbiote matter is the ability to manipulate symbiote matter"}, {"start": 226.66, "end": 232.74, "text": " It would be like saying that iron man with the infinity gauntlet is less powerful than thanos with the infinity gauntlet"}, {"start": 232.82, "end": 237.29999999999998, "text": " It doesn't make any sense a person wielding a gauntlet is a person wielding a gauntlet and that's it"}, {"start": 237.54, "end": 240.9, "text": " The ultimate nullifier is a whole different discussion though, but back on track"}, {"start": 241.70000000000002, "end": 248.74, "text": " But the thing here is that as they start to realize this specifically wild he says then I don't have to become you"}, {"start": 249.14000000000001, "end": 252.74, "text": " Like there was never a cage. We're free tyro"}, {"start": 253.06, "end": 259.22, "text": " We're all free and tyro responds and saying after everything we've done everything that was done to us"}, {"start": 259.78000000000003, "end": 263.7, "text": " You want all of that to be for nothing. I'm meant to become meridius"}, {"start": 263.78000000000003, "end": 269.86, "text": " It's my destiny to rule this garden. I don't want to be free. It can't be for nothing"}, {"start": 270.02000000000004, "end": 270.58000000000004, "text": " so again"}, {"start": 270.58000000000004, "end": 276.82, "text": " That's where all of this stuff comes from is how all of this stuff functions because eddie brock will become tyro"}, {"start": 277.22, "end": 281.62, "text": " Before he becomes meridius and can we all just kind of look at tyro for a second?"}, {"start": 281.86, "end": 284.1, "text": " And just acknowledge the fact that what he has on his chest"}, {"start": 284.5, "end": 287.62, "text": " Kind of makes him look like he's part of the lantern core from dc comics"}, {"start": 287.86, "end": 289.86, "text": " He's not but it'd be dope if he was"}, {"start": 291.06, "end": 298.58000000000004, "text": " But tyro ends up going after eddie prime and when that happens the finnegan symbiote emerges now finnegan"}, {"start": 298.82, "end": 304.02, "text": " Represents denial more than anything else when eddie brock first died and first got here"}, {"start": 304.26, "end": 308.26, "text": " He denied the fact that he was actually supposed to be here and in doing so"}, {"start": 308.82, "end": 312.02, "text": " Became finnegan, right? So that's kind of how this process works"}, {"start": 312.34, "end": 319.21999999999997, "text": " Tyro is the version of eddie brock who more or less accepts his fate and now he lusts for the power of meridius"}, {"start": 319.21999999999997, "end": 325.06, "text": " So again, that's kind of how this process goes from one to the other leading to meridius itself"}, {"start": 325.46, "end": 330.9, "text": " And so in fact even when tyro and finnegan are talking to each other that"}, {"start": 331.38, "end": 336.1, "text": " Tyro refers to finnegan almost like he's somebody else like he's a wholly different person"}, {"start": 336.42, "end": 342.74, "text": " That is not even what finnegan used to be and so it's finnegan and tyro are going back and forth with each other"}, {"start": 343.22, "end": 348.74, "text": " tyro refers to finnegan as if he is someone that is not him because"}, {"start": 349.06, "end": 355.22, "text": " Finnegan is what tyro was at some point in time like you when you were 13 years old"}, {"start": 355.38, "end": 360.34000000000003, "text": " Your 13 year old self is not a wholly different person. It's just you some number of years ago"}, {"start": 360.58, "end": 365.06, "text": " And so that's why finnegan responds and says sniveling i'm you you're me"}, {"start": 365.3, "end": 368.74, "text": " I was praying for this for a chance to break the loop"}, {"start": 369.06, "end": 374.42, "text": " To prevent dylan's death dylan being the son of eddie brock and you turn that down"}, {"start": 374.82, "end": 380.34000000000003, "text": " What's wrong with you and that's when tyro's like wait a minute prevent what and he was like you idiot"}, {"start": 380.74, "end": 383.86, "text": " Dylan's not dead you moron. He's stronger now"}, {"start": 384.02000000000004, "end": 387.70000000000005, "text": " He's got his own hive his own army and when he's ready"}, {"start": 388.02000000000004, "end": 392.42, "text": " He will be the way in which meridius escapes and the response of eddie"}, {"start": 392.74, "end": 397.78000000000003, "text": " That's not his job because one of the things to know is that dylan the son of eddie brock"}, {"start": 398.1, "end": 401.94, "text": " Is a king in black without truly playing the role of a king in black"}, {"start": 402.1, "end": 407.7, "text": " And what I mean by that is the king in black is as much power passed down from one person to the next"}, {"start": 407.94, "end": 414.02, "text": " As it is a mantle passed down from one person to the next the original king in black the first king in black"}, {"start": 414.34, "end": 421.54, "text": " In every universe is always null the symbiote god because he's the one that creates the symbiotes in the first place"}, {"start": 421.78, "end": 428.02, "text": " He creates them. He commands them. He controls them, but in every universe venom whether it's eddie brock"}, {"start": 428.18, "end": 431.94, "text": " Seemingly it always is eddie brock, but whether it's eddie or potentially some other host"}, {"start": 432.34, "end": 439.21999999999997, "text": " They always destroy null and they always replace null and become the king in black going forward"}, {"start": 439.53999999999996, "end": 445.94, "text": " The difference between that and dylan is dylan because his mom was possessed by the venom symbiote"}, {"start": 446.26, "end": 452.65999999999997, "text": " At the time that he was born at least specifically within the main marvel universe and weighing is the person that i'm talking about"}, {"start": 453.06, "end": 460.82000000000005, "text": " That dylan was born with the ability to manipulate symbiotes because he is part symbiont and so in effect"}, {"start": 460.90000000000003, "end": 468.58000000000004, "text": " He is the way in which meridius can escape his fate because meridius can use dylan to control all symbiotes in existence"}, {"start": 468.82000000000005, "end": 471.64000000000004, "text": " Because meridius can only leave this realm temporarily"}, {"start": 472.18, "end": 474.18, "text": " He can't stay gone for too long"}, {"start": 474.34000000000003, "end": 480.1, "text": " And even if he does he can't necessarily control all things because he would have to contend with the power of dylan"}, {"start": 480.42, "end": 482.42, "text": " And dylan of course would more or less run against him"}, {"start": 482.58000000000004, "end": 489.62, "text": " But by manipulating dylan controlling dylan tricking dylan into believing that meridius is his friend right a good guy"}, {"start": 490.1, "end": 492.66, "text": " Then he can use him and with the two of them working together"}, {"start": 493.12, "end": 497.38, "text": " Meridius can take over dylan and then rule all of creation"}, {"start": 497.62, "end": 505.06, "text": " And so that's where eddie says he should never have become some symbiote warrior again speaking about his son dylan with his own hive"}, {"start": 505.46000000000004, "end": 511.3, "text": " We should never have put him in that position. He's not a tool. He's a kid. He's our son"}, {"start": 511.54, "end": 513.54, "text": " It's not his job to help us"}, {"start": 513.86, "end": 515.86, "text": " It's our job to help him"}, {"start": 515.94, "end": 523.54, "text": " And if you're too far gone to see that you need to sit this one out and eddie brock kills this guy on the spot"}, {"start": 523.94, "end": 526.34, "text": " And that's where he looks at wild and says what about you man?"}, {"start": 526.42, "end": 530.98, "text": " Like do you have any smart remarks and he's like, nope, uh, i'm just watching the show"}, {"start": 531.62, "end": 533.38, "text": " Checking it out just seeing what's happening"}, {"start": 533.54, "end": 536.36, "text": " And in fact you even have both versions of the bedlam symbiotes"}, {"start": 536.6800000000001, "end": 542.28, "text": " That have actually merged their heads together and now they're involved in a kind of like mental battle with each other"}, {"start": 542.36, "end": 544.92, "text": " Right a lot of this is just because the bedlam symbiotes are kind of dumb"}, {"start": 545.08, "end": 550.52, "text": " They kind of reflect eddie brock when he was like first becoming venom and he wasn't the sharpest tool in the shed"}, {"start": 550.76, "end": 553.58, "text": " Right, just some lumbering beast fighting spider-man"}, {"start": 555.0, "end": 558.6, "text": " But in the midst of all this meridius emerges now"}, {"start": 558.76, "end": 565.72, "text": " This is the part that you are either going to agree with or you're going to hate but it is going to require an"}, {"start": 566.34, "end": 567.96, "text": " explanation so"}, {"start": 567.96, "end": 574.44, "text": " What happens when meridius emerges here is he taunts eddie brock and even the other symbiotes that are with him?"}, {"start": 574.6800000000001, "end": 579.08, "text": " Right. He was like i'm not very happy. I am not happy at all"}, {"start": 579.48, "end": 582.28, "text": " It's not that you tried to kill me. I can respect that"}, {"start": 582.6, "end": 586.36, "text": " It's not that you've evidently broken free of the cage of events"}, {"start": 586.76, "end": 592.86, "text": " I'm envious, but it shows it can be done. I can free myself from the eventuality"}, {"start": 593.58, "end": 596.7, "text": " And I will that's not why i'm mad eddie"}, {"start": 597.02, "end": 603.42, "text": " I'm mad because you're so stupid because you still don't know what the garden is"}, {"start": 603.74, "end": 610.94, "text": " Do you you think it's dead symbiote matter that I shaped like clay. There's no such thing as dead symbiote matter"}, {"start": 611.34, "end": 617.26, "text": " All symbiote is alive eddie just unclaimed by a mind. I didn't sculpt it"}, {"start": 617.58, "end": 621.5, "text": " I took it. I am the garden brock. This is my body"}, {"start": 621.9, "end": 626.38, "text": " This is my blood and what I giveth I can taketh away"}, {"start": 626.62, "end": 632.14, "text": " And so what he does is he snatches the symbiotes off of everybody else"}, {"start": 632.84, "end": 635.02, "text": " Including eddie himself, right?"}, {"start": 635.1, "end": 642.22, "text": " Like eddie still has control over symbiote matter and that's where he and the king in black are absolute equals, right?"}, {"start": 642.3000000000001, "end": 649.26, "text": " He and meridius are identical in terms of power and he says you're alone brock and for all your tricks"}, {"start": 649.34, "end": 653.1800000000001, "text": " You're only human twist turn resurrect all you like"}, {"start": 653.58, "end": 659.1, "text": " Carbon-based cells will always lose to symbiote because the flesh is weak"}, {"start": 659.4200000000001, "end": 662.78, "text": " But you're not the only one who can make symbiotes dance"}, {"start": 663.1, "end": 669.1800000000001, "text": " We're both the king in black you think any goo in this garden will listen to you over me"}, {"start": 669.58, "end": 677.0200000000001, "text": " I've got the power eddie in centuries of experience there isn't one mind in all of space and time"}, {"start": 677.4200000000001, "end": 683.9000000000001, "text": " That can subvert my will the kicker about all this is that in the middle of it suddenly his nose starts bleeding"}, {"start": 684.0600000000001, "end": 685.4200000000001, "text": " And it's like, okay"}, {"start": 685.4200000000001, "end": 690.7, "text": " What in the world is going on and then like his chest starts bleeding and eddie brock looks at it"}, {"start": 690.7, "end": 695.1, "text": " He's like is that blood and like meridius is only common is like my chest hurts"}, {"start": 695.66, "end": 700.86, "text": " Right, and so you have wild who's looking at this right his symbiote form kind of returned to him and it's like you're kidding"}, {"start": 701.1, "end": 707.26, "text": " How does a 30-foot tall mega symbiote with hollywood teeth have a heart attack and the response of eddie?"}, {"start": 707.58, "end": 713.1, "text": " I don't think that's what this is. That's not blood. It's just"}, {"start": 713.74, "end": 718.22, "text": " Red and that's where meridius is like everything is red"}, {"start": 718.86, "end": 721.82, "text": " red as carnage right and carnage"}, {"start": 722.46, "end": 729.1, "text": " Busts out of the chest of meridius and it's just like red as carnage and he's just like your faces, right?"}, {"start": 729.2600000000001, "end": 736.7800000000001, "text": " You know, I could have sworn I saw a giant hand burning candles for fingers a great burning engine"}, {"start": 737.1, "end": 742.94, "text": " Now there's a god I thought so I dove into the black water and went for a swim"}, {"start": 742.94, "end": 748.94, "text": " But instead of there i'm here in your heaven eddie. And so this is the important thing, right?"}, {"start": 749.1, "end": 756.3800000000001, "text": " This is where the confusion has come into play for everybody and it makes perfect sense because this was the natural ending"}, {"start": 756.62, "end": 758.0600000000001, "text": " to the story"}, {"start": 758.0600000000001, "end": 765.1, "text": " Death of the venom verse when carnage was going through the entirety of the multiverse tracking down every version of venom"}, {"start": 765.1800000000001, "end": 771.74, "text": " He could possibly find killing them absorbing their powers and basically nullifying any weakness for himself"}, {"start": 771.98, "end": 774.94, "text": " So he could track down this version of eddie brock"}, {"start": 775.58, "end": 782.0, "text": " Kill him replace him as a king in black and seize control of the entire universe which he undoubtedly"}, {"start": 782.5400000000001, "end": 786.7800000000001, "text": " Would do the kicker about all this is the current carnage run"}, {"start": 787.2600000000001, "end": 791.82, "text": " Flies in the face of all of that that while he was out there on this mission"}, {"start": 792.22, "end": 798.86, "text": " Carnage came back to earth and basically started forming a kind of cult for himself in order to establish himself as god"}, {"start": 799.0200000000001, "end": 803.34, "text": " So, I don't know if like marvel forgot. I have no idea what's going on here"}, {"start": 803.5, "end": 808.96, "text": " The reality is that we kind of have to wait and see how the carnage solo series unfolds"}, {"start": 809.34, "end": 815.5, "text": " In order to see where this takes place because maybe this takes place immediately after the death of venom verse"}, {"start": 815.6600000000001, "end": 818.62, "text": " Or maybe it takes place after the current carnage series"}, {"start": 818.86, "end": 826.14, "text": " We don't know but the important thing is eddie and all these guys are flabbergasted their minds are blown in seeing"}, {"start": 826.62, "end": 832.88, "text": " Carnage here because they all understand the clear and present danger that carnage represents right where he says meridius"}, {"start": 833.28, "end": 839.12, "text": " That's the big one's name isn't and he's like big eddies and smaller eddies and little stirring cheese eddies"}, {"start": 839.36, "end": 844.64, "text": " It's like a smorgasbord. Why'd I end up in him? I wonder some past connections"}, {"start": 845.04, "end": 850.4, "text": " Do we link up in the future both at once? These are the questions I have to ask myself now"}, {"start": 850.88, "end": 853.84, "text": " Now that i'm a god did I mention that i'm a god eddie?"}, {"start": 854.0, "end": 860.24, "text": " And so one of the symbiotes goes to attack and carnage stops this guy on the spot and stabs him in the chest"}, {"start": 860.48, "end": 865.92, "text": " And then in turn like this dude just gets absorbed like that's literally it right"}, {"start": 865.92, "end": 869.52, "text": " He just takes the entirety of this guy's power and that in turn"}, {"start": 869.92, "end": 876.88, "text": " Carnage actually reveals that he's the one that stabbed dylan right that he's actually the reason why dylan's dead"}, {"start": 876.88, "end": 879.28, "text": " He says I murdered your boy old man"}, {"start": 879.76, "end": 886.0, "text": " Dylan's dead and you're next which just leaves the showdown between carnage and venom"}, {"start": 886.32, "end": 891.2, "text": " Let me know what you guys think because reddit's pissed but reddit's always mad so their opinions don't matter"}, {"start": 891.28, "end": 895.28, "text": " So let me know what you guys think about this down in the comments section. I'm curious"}, {"start": 895.52, "end": 898.24, "text": " But with that being said guys, we're gonna bring this to an end if you need to get caught up"}, {"start": 898.48, "end": 901.36, "text": " Make sure you click this link to the playlist and I will catch you all later"}, {"start": 902.24, "end": 904.24, "text": " peace"}]}